/*
* 1
* В векторе целого типа заменить максимальный элемент суммой предыдущих элементов, минимальный – суммой последующих элементов.
* 
* 2
* Дана строка слов, разделенных пробелами. Сформируйте новую строку, вставив перед каждым вхождением слова "and" запятую. 
* Определите, сколько в строке симметричных слов (слов-перевёртышей, например, «казак», «шалаш»).
*/
#include <iostream>
#include <algorithm>

int main()
{
    std::cout << "Hello World!\n";
}

